In [1]:
# check for null values

import pandas as pd
data = pd.read_csv("data.csv")
print(data)

       Name   Age      Position  Experience   Salary
0     Nitin  24.0       ML Engg         4.0  22000.0
1  Harshita  23.0       ML Engg         3.0  18000.0
2      Arya   NaN  Data Analyst         NaN      NaN
3     Gagan   NaN  Data Analyst         2.0  10000.0
4   Randhir   NaN           NaN         4.0  16000.0
5    Saurav  22.0         admin         3.0   8000.0
6     Manoj  31.0       Manager        11.0  25000.0

In [2]:
# check for null data
res = data.isnull().sum()
print(res)

Name          0
Age           3
Position      1
Experience    1
Salary        1
dtype: int64

In [3]:
# find out all whose age is null
d1 = data[data.Age.isnull()]
print(d1)

      Name  Age      Position  Experience   Salary
2     Arya  NaN  Data Analyst         NaN      NaN
3    Gagan  NaN  Data Analyst         2.0  10000.0
4  Randhir  NaN           NaN         4.0  16000.0

In [4]:
# if any value is null
d3 = data[data.isnull().any(axis=1)]
print(d3)

      Name  Age      Position  Experience   Salary
2     Arya  NaN  Data Analyst         NaN      NaN
3    Gagan  NaN  Data Analyst         2.0  10000.0
4  Randhir  NaN           NaN         4.0  16000.0

### How to drop ?

In [5]:
# drops if any null values are present
d1 = data.dropna(how="any", axis=0)
print(d1)

# arya, gagan, randhir got dropped

       Name   Age Position  Experience   Salary
0     Nitin  24.0  ML Engg         4.0  22000.0
1  Harshita  23.0  ML Engg         3.0  18000.0
5    Saurav  22.0    admin         3.0   8000.0
6     Manoj  31.0  Manager        11.0  25000.0

In [6]:
# drop whose salary is null
d2  = data.dropna(subset=["Salary"])
print(d2)

# arya got dropped

       Name   Age      Position  Experience   Salary
0     Nitin  24.0       ML Engg         4.0  22000.0
1  Harshita  23.0       ML Engg         3.0  18000.0
3     Gagan   NaN  Data Analyst         2.0  10000.0
4   Randhir   NaN           NaN         4.0  16000.0
5    Saurav  22.0         admin         3.0   8000.0
6     Manoj  31.0       Manager        11.0  25000.0

### How to fill missing values ?

In [7]:
d1 = data.fillna({"Age": data["Age"].mean()})
print(d1)

       Name   Age      Position  Experience   Salary
0     Nitin  24.0       ML Engg         4.0  22000.0
1  Harshita  23.0       ML Engg         3.0  18000.0
2      Arya  25.0  Data Analyst         NaN      NaN
3     Gagan  25.0  Data Analyst         2.0  10000.0
4   Randhir  25.0           NaN         4.0  16000.0
5    Saurav  22.0         admin         3.0   8000.0
6     Manoj  31.0       Manager        11.0  25000.0

In [8]:
# fill missing values in Experience
d2 = data.fillna({"Experience": data["Experience"].mean()})
print(d2)
print(" ")

       Name   Age      Position  Experience   Salary
0     Nitin  24.0       ML Engg         4.0  22000.0
1  Harshita  23.0       ML Engg         3.0  18000.0
2      Arya   NaN  Data Analyst         4.5      NaN
3     Gagan   NaN  Data Analyst         2.0  10000.0
4   Randhir   NaN           NaN         4.0  16000.0
5    Saurav  22.0         admin         3.0   8000.0
6     Manoj  31.0       Manager        11.0  25000.0

In [9]:
# filling null values in Position by a default one
d3 = data.fillna({"Position": "Unallocated"})
print(d3)

       Name   Age      Position  Experience   Salary
0     Nitin  24.0       ML Engg         4.0  22000.0
1  Harshita  23.0       ML Engg         3.0  18000.0
2      Arya   NaN  Data Analyst         NaN      NaN
3     Gagan   NaN  Data Analyst         2.0  10000.0
4   Randhir   NaN   Unallocated         4.0  16000.0
5    Saurav  22.0         admin         3.0   8000.0
6     Manoj  31.0       Manager        11.0  25000.0